#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.KEYCLOAK_TEST.module.moh_applications.module.CGI-DEVELOPER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/ba2aead8-cd2d-4519-991b-3bd44c71c057]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.KEYCLOAK_TEST.module.moh_applications.module.EHPR.keycloak_openid_client.CLIENT has changed
  ~ resource "keycloak_openid_client" "CLIENT" {
      + extra_config                               = {}
        id                                         = "5d7e97ac-0e74-4133-9e0c-da1f05bb5e53"
        name                                       = "EHPR"
      + web_origins                                = []
        # (22 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_TEST.module.moh_applications.module.USAM.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "USAM"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Unified Secure Account Management. This application will be used to enable Healthideas users with Oracle accounts to self-unlock their accounts within specific circumstances."
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "USAM"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "http://localhost:*",
          + "https://localhost:*",
        ]
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USAM.keycloak_openid_user_attribute_protocol_mapper.idir_displayName will be created
  + resource "keycloak_openid_user_attribute_protocol_mapper" "idir_displayName" {
      + add_to_access_token  = true
      + add_to_id_token      = true
      + add_to_userinfo      = true
      + aggregate_attributes = false
      + claim_name           = "idir_displayName"
      + claim_value_type     = "String"
      + client_id            = (known after apply)
      + id                   = (known after apply)
      + multivalued          = false
      + name                 = "idir_displayName"
      + realm_id             = "moh_applications"
      + user_attribute       = "idir_displayName"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USAM.keycloak_openid_user_attribute_protocol_mapper.idir_username will be created
  + resource "keycloak_openid_user_attribute_protocol_mapper" "idir_username" {
      + add_to_access_token  = true
      + add_to_id_token      = true
      + add_to_userinfo      = true
      + aggregate_attributes = false
      + claim_name           = "idir_username"
      + claim_value_type     = "String"
      + client_id            = (known after apply)
      + id                   = (known after apply)
      + multivalued          = false
      + name                 = "idir_username"
      + realm_id             = "moh_applications"
      + user_attribute       = "idir_username"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*